Revit 2026 API

# eRefFace Enumeration

---

Indicates the reference face. The Opening will be created at the direction perpendicular to the reference face.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum eRefFace
```
```vb
Public Enumeration eRefFace
```
```cpp
public enum class eRefFace
```
```fsharp
type eRefFace
```

| Member name | Value | Description |
| --- | --- | --- |
| CenterX | 1 | The reference face is at the middle of the element in the direction of x-axis and its normal is parallel to x-axis. |
| CenterY | 4 | The reference face is at the middle of the element in the direction of y-axis and its normal is parallel to y-axis. |
| CenterZ | 7 | The reference face is at the middle of the element in the direction of z-axis and its normal is parallel to z-axis. |

Direction of the opening.

#### Reference

Autodesk.Revit.Creation Namespace